app/views/category/show.html.erb

          <% @category.each do |cat| %>
            <% if ((cat.sub_id == @find || check_shared_cat(Category.find(@find).name, cat.sub_id)) && cat.sub_id != nil)%>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 11]]