app/controllers/add_cate_controller.rb

  def index
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    @pro = Pro.all
    @users = Info.all
    @category = Category.all
    @site = Site.all
---
SELECT "categories".* FROM "categories"
SELECT "sites".* FROM "sites"

  def create_sites
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Site.create title: params[:title], link: params[:link] ,image: params[:image], min_price: params[:min_price],
    max_price: params[:max_price], time: params[:time], def: params[:def], category_id: params[:category_id]
---
INSERT INTO "sites" ("title", "link", "image", "min_price", "max_price", "time", "def", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def create_cat
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Category.create name: params[:name], sub_id: params[:sub_id]
---
INSERT INTO "categories" ("name", "sub_id") VALUES (?, ?)  [["name", "CHAUFFAGE"], ["sub_id", 1]]

  def delete_item
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Category.find(params[:sub_id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 7]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 7]]

  def delete_site
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Site.find(params[:sub_id]).destroy
---
DELETE FROM "sites" WHERE "sites"."id" = ?  [["id", 18]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 18]]

  def edit_site
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    @category = Category.all
    @site = Site.find(params[:id])
---
SELECT "categories".* FROM "categories"
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", nil]]

  def edit_cate
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    @category = Category.find(params[:id])
    @cate = Category.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", nil]]
SELECT "categories".* FROM "categories"

  def update_site
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Site.find(params[:id]).update title: params[:title], link: params[:link] ,image: params[:image], min_price: params[:min_price],
    max_price: params[:max_price], time: params[:time], def: params[:def], category_id: params[:category_id], origin_id: params[:origin_id]
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 20]]
UPDATE "sites" SET "image" = ?, "time" = ?, "def" = ?, "category_id" = ?, "updated_at" = ? WHERE "sites"."id" = ?  [["image", ""], ["time", ""], ["def", ""], ["category_id", 2], ["updated_at", "2016-11-07 11:00:14.712236"], ["id", 4]]

  def update_cate
    @current_user = session[:user_id]
    @current_user = User.find(@current_user)
    if (@current_user.cate != 1)
      redirect_to "/admin"
    end
    Category.find(params[:id]).update name: params[:name], sub_id: params[:sub_id]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "categories" SET "name" = ?, "sub_id" = ? WHERE "categories"."id" = ?  [["name", "toto2"], ["sub_id", 5], ["id", 8]]