app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"
SELECT "sites".* FROM "sites"
---
  def show
    @category = Category.all
    @category.each do |target|
      if (target.name == params[:name])
        @find = target.id
      end
    end
    @site = Site.all