app/controllers/sites_controller.rb

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 23]]
---
  def estimations
    @page = Site.find(params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 6]]
---
  def commande
    @page = Site.find(params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 91]]
---
  def payement
    @products = Site.find(session[:id_proud])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 90]]
---
  def validate
    @products = Site.find(session[:id_proud])

INSERT INTO "infos" ("addresse", "code_p", "inter_digi", "prenom", "nom", "mail", "tel") VALUES (?, ?, ?, ?, ?, ?, ?)  [["addresse", "2 boulevard Orloff"], ["code_p", "77300"], ["inter_digi", "[:etage]"], ["prenom", "Ugo"], ["nom", "pereira"], ["mail", "ugo@hml.com"], ["tel", "1234567890"]]
---
  def create
    Info.create addresse: params[:adresse],
                  code_p: params[:postal],
                  inter_digi: params[:etage],
                  prenom: params[:prenom],
                  nom: params[:nom],
                  mail: params[:mail],
                  tel: params[:tel],
                  id_prod: params[:id_prod],
                  state: "Nouveau"