app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def login
    if (session[:user_id] == 4 || session[:user_id] == 3)
      redirect_to "/admin/add"
    end
    if session[:user_id]
      @current_user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "bozo"]]
---
  def check
    @current_user = User.where(name: params[:name]).first